## Pandas Day -14

### merge() function 
- **`merge()`** in Pandas is used to combine DataFrames based on common column values.

In [2]:
import pandas as pd

### Creating Sample DataFrames

In [3]:
df1 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Name": ["Amit", "Rahul", "Neha"]
})

In [4]:
df2 = pd.DataFrame({
    "ID": [1, 2, 4],
    "Marks": [85, 78, 90]
})

In [5]:
display(df1,df2)

   ID   Name
0   1   Amit
1   2  Rahul
2   3   Neha

   ID  Marks
0   1     85
1   2     78
2   4     90

### Inner Merge

In [6]:
df_inner = pd.merge(df1, df2, on="ID", how="inner")
df_inner

   ID   Name  Marks
0   1   Amit     85
1   2  Rahul     78

### Left Merge

In [7]:
df_left = pd.merge(df1, df2, on="ID", how="left")
df_left

   ID   Name  Marks
0   1   Amit   85.0
1   2  Rahul   78.0
2   3   Neha    NaN

### Right Merge

In [9]:
df_right = pd.merge(df1, df2, on="ID", how="right")
df_right

   ID   Name  Marks
0   1   Amit     85
1   2  Rahul     78
2   4    NaN     90

### Outer Merge

In [10]:
df_outer = pd.merge(df1, df2, on="ID", how="outer")
df_outer

   ID   Name  Marks
0   1   Amit   85.0
1   2  Rahul   78.0
2   3   Neha    NaN
3   4    NaN   90.0

### Merge with Different Column Names

In [11]:
df3 = pd.DataFrame({
    "Student_ID": [1, 2, 3],
    "City": ["Nagpur", "Pune", "Mumbai"]
})

In [12]:
df_merge_diff = pd.merge(df1, df3, left_on="ID", right_on="Student_ID")
df_merge_diff

   ID   Name  Student_ID    City
0   1   Amit           1  Nagpur
1   2  Rahul           2    Pune
2   3   Neha           3  Mumbai

In [12]:
pd.merge(df1,df2,on='Id')

   Id Name  Class
0   1    A      6
1   2    B      7
2   3    C      8
3   4    D      9
4   5    E     10

### Outer merge with indicator

In [13]:
pd.merge(df1,df2,how='outer',indicator=True)

   ID   Name  Marks      _merge
0   1   Amit   85.0        both
1   2  Rahul   78.0        both
2   3   Neha    NaN   left_only
3   4    NaN   90.0  right_only

### Merge with suffixes

In [14]:
df1.merge(df2,left_index=True,right_index=True,suffixes=('_High','_Low'))

   ID_High   Name  ID_Low  Marks
0        1   Amit       1     85
1        2  Rahul       2     78
2        3   Neha       4     90